#include <iostream>								//това включва библиотеката <iostream> за вход/изход(потоци) на данни
												//тая работа се извършва от препроцесора.Един вид той взима някакъв
												//външен готов код(в случая за iostream) и го вкарва(include)
												//в твоята програма чрез тоя един ред.

int main()										//функция,която присъства във програмите и е нужна за да тръгнат от нея,т.е main дава
{												//началото/живота на програмата (тази функция е първа във стека и образува стекова рамка)
												//като вече ако извикваш други функции,те от своя страна образуват техни си рамки над тази
												//на main функцията

	int year;									//създаваш променлива от даден тип - образуваш клетка в паметта на компютъра	
	std::cout << "Enter a year: ";				//извежда на екрана съобщение в конзолата ("cout" идва от "console output")

	std::cin >> year;							//прочита или взима,в случая, от клавиатурата информация

	if (year >= 2001 && year <= 2100)			//задава условие,което ако е валидно се изпълнява кода в блока под него,в противен
	{											//случай изпълнява else-блока.Двата символа &&(означават "и") и работят на принципа
												//"ако този израз" и "този друг израз" се оценяват верни(true) ,то тогава "целия израз е true"
												//и се изпълнява кодът в if-блока,ако е  false - се изпълнява else-блока.
		std::cout << "The year " << year << " is in 21century! \n";
	}
	else
	{
		std::cout << "Year "<<year<<" is not in 21century! \n";
	}

	return 0;									//функциите се делят на два типа,такива ,от които се очаква да връщат резултат и такива,от които-не
												//първите са (int,bool,float,double,unsigned...дата типове)
												//вторите са (void-не връщат нищо)
												//тук е написано return 0; ,за да се уверим,че всичко е успешно.(във main този ред може да се пропусне)
												//тъй като компилатора сам/скрито ще си въведе return-a.
}