/*Зад.7

Веднъж в една гора омайна, в доба тъмна и потайна, попаднал великият вълшебен ловец на дълги числа. Макар дългите числа 
старателно да криели голямата си опашка от цифри той, като един виден професионалист, добре обучен в занаята, винаги ги откривал. 
В тихата безлунна нощ попаднал на дирите на страхотно дъгло число. На него му е достатъчно да види само последната цифра на 
търсеното число - нали все пак е вълшебен ловец. За голямо съжаление Вие трябва да разчитате, не на вълшебни умения, а на простичка
логика и на цикъл do while. Дадени са две естествени числа А, В от интервала [1001..10001],
където А е начален член на геометрична прогресия, а В е частното. Да се състави програма, чрез която по въведени 2 
естествени числа от указания интервал се извежда последната цифра на 101-вия член на геометричната прогресия.*/


#include <iostream>
#include <cmath>

int main()
{
	unsigned long long int a, b,c;
	std::cin >> a >> b;

	int i = 0;
	
	do
	{
		c = a*pow(b,i);
		i++;
	} while (i < 10);

	std::cout << c%10<<"\n";

	return 0;
}