/*Зад.6
Едно положително цяло число е съвършено, ако е равно на сумата от своите делители (без самото число). Например, 6 е съвършено,
защото 6 = 1+2+3; числото 1 не е съвършено. Да се напише проце- дура, която намира и отпечатва на екрана всички съвършени чис- ла,
ненадминаващи дадено положително цяло число в параметър n.*/

#include <iostream>

void findperfect(int num)
{
	int sum = 1;
	for (int i = 1; i <= num; i++)
	{
		for (int j = 2; j < i; j++)
		{
			if (i%j == 0)
			{
				sum += j;
			}
		}
		if (sum == i)
		{
			if(i!=1)
			std::cout << i << " ";
			sum = 1;
		}
		else
		{
			sum = 1;
		}
	}

}

int main()
{
	int num;
	std::cin >> num;
	findperfect(num);
	std::cout << "\n";

	return 0;
}