/*Зад.17
Да се напише булев израз, който да има стойност истина, ако посоченото условие е вярно и стойност лъжа, в противен случай:
    -цялото число n се дели на 3 и на 5, на 2 и на 7;
    -точка с координати (x, y) лежи във вътрешността на кръг с радиус 7 и център с координати (3, -1);
    -точка принадлежи на на частта от кръга с център (0, 0) и радиус 12 в първи или в трети квадрант;
    -точка се намира във фигурата тип “геврек” с център (0, 0) и радиуси 6 и 8;
*/

#include <iostream>
#include <cmath>

int main()
{
	//    -цялото число n се дели на 3 и на 5, на 2 и на 7;

	int num;
	std::cin >> num;

	if ((num % 3 == 0 && num % 5 == 0) && (num % 2 == 0 && num % 7 == 0))
	{
		std::cout << "true\n";
	}
	else
	{
		std::cout << "false\n";
	}

	//    -точка с координати (x, y) лежи във вътрешността на кръг с радиус 7 и център с координати (3, -1);
	int x, y, xc, yc, r;
	xc = 3;
	yc = -1;
	r = 7;

	std::cin >> x >> y;
	
	if (sqrt(pow(x-xc,2)+ pow(y-yc,2))<r)
	{
		std::cout << "true\n";
	}
	else
	{
		std::cout << "false\n";
	}

	//    -точка принадлежи на на частта от кръга с център (0, 0) и радиус 12 в първи или в трети квадрант;
	int x2, y2, xc2, yc2, r2;
	xc2 = 0;
	yc2 = 0;
	r2 = 12;

	std::cin >> x2 >> y2;

	if (((x2 >= xc2 && y2 >= yc2) && (sqrt(pow(x2 - xc2, 2) + pow(y2 - yc2, 2)) <= r2)) || 
	    ((x2 <= xc2 && y2 <= yc2) && (sqrt(pow(x2 - xc2, 2) + pow(y2 - yc2, 2)) <= r2)))
	{
		std::cout << "true\n";
	}
	else
	{
		std::cout << "false\n";
	}
	
	//    -точка се намира във фигурата тип “геврек” с център (0, 0) и радиуси 6 и 8;
	int x3, y3, xc3, yc3, r3,r4;
	xc3 = 0;
	yc3 = 0;
	r3 = 6;
	r4 = 8;

	std::cin >> x3 >> y3;

	if ((sqrt(pow(x3 - xc3, 2) + pow(y3 - yc3, 2))>r3) && (sqrt(pow(x3 - xc3, 2) + pow(y3 - yc3, 2))<r4))
	
	{
		std::cout << "true\n";
	}
	else
	{
		std::cout << "false\n";
	}
	
	
	return 0;
}