/*Зад.2 Един от дефектите на клавиатура е "залепване", в резултат на което при едно натискане на клавиш се въвеждат
множество от повтарящи се символи. Да се състави програма на C++, чрез която се въвежда стринг с повтарящи се съседни 
символи. Програмата да изведе стринг съдържащ само неповтарящи се съседни символи.*/

#include <iostream>

void remake(char* text)
{
	for (int i = 0; text[i] != '\0'; i++)
	{
		if (text[i] != text[i + 1])
		{
			std::cout << text[i];
		}
	}
}

int main()
{
	char* text = new char[10000];
	std::cin.getline(text, 10000);
	remake(text);
	std::cout << "\n";


	return 0;
}